Revit 2027 API
ProjectInfo.ClientName Property
Get or Set the Client Name of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ClientName { get; set; }
Public Property ClientName As String
	Get
	Set
public:
property String^ ClientName {
	String^ get ();
	void set (String^ value);
}
member ClientName : string with get, set
Property Value
String
Remarks
This property is used to get or set the Project Client Name of the Project Information.
See Also
Reference
ProjectInfo Class
Autodesk.Revit.DB Namespace